#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mazurerm_static_site.site: Refreshing state... [id=/subscriptions/e35f2b7a-c9ca-4ee0-9db3-d85061d32776/resourceGroups/crc-dev/providers/Microsoft.Web/staticSites/CRC-Client-Prod][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # azurerm_cosmosdb_account.db[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_cosmosdb_account" "db" {
      [32m+[0m [0m[1m[0maccess_key_metadata_writes_enabled[0m[0m    = true
      [32m+[0m [0m[1m[0manalytical_storage_enabled[0m[0m            = false
      [32m+[0m [0m[1m[0mconnection_strings[0m[0m                    = (sensitive value)
      [32m+[0m [0m[1m[0mcreate_mode[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mdefault_identity_type[0m[0m                 = "FirstPartyIdentity"
      [32m+[0m [0m[1m[0menable_automatic_failover[0m[0m             = true
      [32m+[0m [0m[1m[0menable_free_tier[0m[0m                      = false
      [32m+[0m [0m[1m[0menable_multiple_write_locations[0m[0m       = false
      [32m+[0m [0m[1m[0mendpoint[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                    = (known after apply)
      [32m+[0m [0m[1m[0mis_virtual_network_filter_enabled[0m[0m     = false
      [32m+[0m [0m[1m[0mkind[0m[0m                                  = "MongoDB"
      [32m+[0m [0m[1m[0mlocal_authentication_disabled[0m[0m         = false
      [32m+[0m [0m[1m[0mlocation[0m[0m                              = "centralus"
      [32m+[0m [0m[1m[0mmongo_server_version[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                  = "crcsox-client-prod"
      [32m+[0m [0m[1m[0mnetwork_acl_bypass_for_azure_services[0m[0m = false
      [32m+[0m [0m[1m[0moffer_type[0m[0m                            = "Standard"
      [32m+[0m [0m[1m[0mprimary_key[0m[0m                           = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_readonly_key[0m[0m                  = (sensitive value)
      [32m+[0m [0m[1m[0mpublic_network_access_enabled[0m[0m         = true
      [32m+[0m [0m[1m[0mread_endpoints[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m                   = "crc-dev"
      [32m+[0m [0m[1m[0msecondary_key[0m[0m                         = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_readonly_key[0m[0m                = (sensitive value)
      [32m+[0m [0m[1m[0mwrite_endpoints[0m[0m                       = (known after apply)

      [32m+[0m [0manalytical_storage {
          [32m+[0m [0m[1m[0mschema_type[0m[0m = (known after apply)
        }

      [32m+[0m [0mbackup {
          [32m+[0m [0m[1m[0minterval_in_minutes[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mretention_in_hours[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mstorage_redundancy[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m                = (known after apply)
        }

      [32m+[0m [0mcapabilities {
          [32m+[0m [0m[1m[0mname[0m[0m = "EnableMongo"
        }
      [32m+[0m [0mcapabilities {
          [32m+[0m [0m[1m[0mname[0m[0m = "EnableServerless"
        }
      [32m+[0m [0mcapabilities {
          [32m+[0m [0m[1m[0mname[0m[0m = "MongoDBv3.4"
        }
      [32m+[0m [0mcapabilities {
          [32m+[0m [0m[1m[0mname[0m[0m = "mongoEnableDocLevelTTL"
        }

      [32m+[0m [0mcapacity {
          [32m+[0m [0m[1m[0mtotal_throughput_limit[0m[0m = (known after apply)
        }

      [32m+[0m [0mconsistency_policy {
          [32m+[0m [0m[1m[0mconsistency_level[0m[0m       = "BoundedStaleness"
          [32m+[0m [0m[1m[0mmax_interval_in_seconds[0m[0m = 300
          [32m+[0m [0m[1m[0mmax_staleness_prefix[0m[0m    = 100000
        }

      [32m+[0m [0mgeo_location {
          [32m+[0m [0m[1m[0mfailover_priority[0m[0m = 0
          [32m+[0m [0m[1m[0mid[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mlocation[0m[0m          = "westus"
          [32m+[0m [0m[1m[0mzone_redundant[0m[0m    = false
        }
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @charliedalldorf, Action: `pull_request`*